emacs/init.org
#+title: Emacs Default Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Basic Configuration

** Early-init File

We deactivate the tool bar and the scroll bar and inhibit the loading of  =default.el=.
#+begin_src emacs-lisp :tangle ./early-init.el :mkdirp yes
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setopt inhibit-default-init t
          visible-bell t)
#+end_src

** Use Lexical Bindings

We use lexical binding in this file.

#+begin_src emacs-lisp

;; -*- lexical-binding: t; -*-
;; Note: This file is automatically generated from default.org.  
;; Please do not edit this file directly but init.org instead.

#+end_src


** Set Current Language Environment

#+begin_src emacs-lisp
  (setopt current-language-environment "UTF-8")
#+end_src


** Enable some disabled Commands

Some commands are disabled by default. So we want to enable them here by removing the symbol property =disabled= of the symbols naming the commands.

#+NAME: set-symbol-property
#+begin_src emacs-lisp 
  (dolist (symbol '(dired-find-alternate-file
                    downcase-region
                    eval-expression
                    narrow-to-page
                    narrow-to-region
                    scroll-left
                    upcase-region))
    (put symbol 'disable nil))
#+end_src

** Load Path for Additional Scripts

#+begin_src emacs-lisp
  (add-to-list 'load-path (expand-file-name "scripts/" "~/.config/emacs/"))
#+end_src

** The Custom File

We want Emacs customizations to be in their own file.

#+begin_src emacs-lisp
  ;;;;* Load Customizations
  (unless (and (boundp 'custom-file)
	       custom-file
	       (file-writable-p custom-file))
    (let ((default-custom-file (expand-file-name "custom.el"
						 (file-name-directory load-file-name))))
      (setq custom-file default-custom-file)))
#+end_src



** Fonts

We use as default and fixed pitch font =Fira Code Retina= (see [[https://github.com/tonsky/FiraCode/wiki/Emacs-instructions][here]]). However the ligatures seem not to work. As variable pitch font we use Fira Sans. The settings are done in the customizings.


** Displaying Line and Column Numbers

We display the line number in the left fringe of the buffer window.
#+begin_src emacs-lisp
  (setopt column-number-mode t
          global-display-line-numbers-mode t)
#+end_src

 However, we disable the feature for following  modes:
 #+NAME: modes-without-linenumbers
 - org-mode
 - dired-mode
 - treemacs-mode
 - term-mode
 - shell-mode
 - ehell-mode

#+NAME: modes-to-hooks
#+begin_src emacs-lisp :var modes=modes-without-linenumbers() :tangle no
  (mapcar (lambda (mode-name)
            (derived-mode-hook-name (intern mode-name)))
          modes)
#+end_src


#+begin_src emacs-lisp :var hooks=modes-to-hooks(modes=modes-without-linenumbers())
  (dolist (hook hooks)
    (add-hook hook (lambda () (display-line-numbers-mode 0))))

  (setopt display-line-numbers-grow-only t
          display-line-numbers-width-start 50
          display-line-numbers-minor-tick 0
          display-line-numbers-major-tick 10)
  (set-face-attribute 'line-number nil
                      :inherit '(shadow default)
                      :foreground "dark slate gray"
                      :height 0.7)
  (set-face-attribute 'line-number-current-line nil
                      :inherit 'line-number
                      :foreground "olive drab")
  (set-face-attribute 'line-number-major-tick nil
                      :inherit 'line-number
                      :foreground "#3f4f0f")
  (set-face-attribute 'line-number-minor-tick nil
                      :inherit 'line-number-major-tick)
#+end_src


** Proxy-connect

Since I don't know how to authenticate Emacs to the proxy of Swiss Life, I use an little =C#= program which listens to the local port =8080= and does the authentication to the proxy.  Here we ensure that the program is running simply by calling the process ~proxy-connect~.

#+begin_src emacs-lisp
  (defvar oa-proxy-connect:*process* nil
    "Contains the process of ch.swisslife.ProxyConnect.")
  (defun oa-proxy-connect:start ()
    "Start ch.swisslife.ProxyConnect and return the process object."
    (interactive)
    (unless (process-live-p oa-proxy-connect:*process*)
      (setq oa-proxy-connect:*process* (start-process "proxy-connect" nil "proxy-connect"))))
  (defun oa-proxy-connect:stop ()
    "Stop ch.swisslife.ProxyConnect and return `true' if a running process has been stopped, `nil' else."
    (interactive)
    (when-let ((livep (process-live-p oa-proxy-connect:*process*)))
      (delete-process oa-proxy-connect:*process*)
      (setq oa-proxy-connect:*process* nil)
      livep))
#+end_src
Proxy-connect listens to the local port 8080.
#+begin_src emacs-lisp
  (setopt url-proxy-services
          '(("no_proxy" . "^\\\\(fi-r-git\\\\|localhost\\\\|10\\\\..*\\\\|192\\\\.168\\\\..*\\\\)")
            ("http" . "localhost:8080")
            ("https" . "localhost:8080")))
#+end_src
Let's start proxy-connect.
#+begin_src emacs-lisp
  (oa-proxy-connect:start)
#+end_src


** Configure the Package System

We set the archives
#+begin_src emacs-lisp
  (require 'package)

  (setopt package-archives
          '(("gnu" . "http://elpa.gnu.org/packages/")
            ("melpa" . "http://melpa.org/packages/")
            ("org" . "http://orgmode.org/elpa/"))
          package-check-signature nil
          package-selected-packages nil)

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src


** Using =use-package=

First we check if =use-package= needs to be intalled, then we tell emacs to require =use-package=. By setting the customizable variable =use-package-always-ensure= to /true/, we won't need to indicate at each =use-package= macro the =:ensure= option.

#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setopt use-package-always-ensure t)
#+end_src


* Basic UI

** Some Default Customizations

#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :custom
    (savehist-mode t)
    (recentf-mode t)
    (recentf-save-file "~/.config/emacs/recentf")
    (recentf-exclude '(".*/[.]recentf\\'"))
    (search-whitespace-regexp ".*?")
    (isearch-allow-scroll t)
    (isearch-lazy-count t)
    (show-paren-style 'expression)
    (enable-recursive-minibuffers t)
    (minibuffer-depth-indicate-mode t)
    (mouse-autoselect-window -0.25)
    (focus-follows-mouse 'auto-raise)
    (indent-tabs-mode nil))
#+end_src

** Key Bindings

*** General

#+begin_src emacs-lisp
  (use-package general)
#+end_src

** Completion

*** All-The-Icons

#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src


*** Vertico

#+begin_src emacs-lisp
  (use-package vertico
    :custom
    (vertico-cycle t)
    (vertico-mode 1))
#+end_src


*** Marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :custom (marginalia-mode 1))
#+end_src


*** All-The-Icons Completion

#+begin_src emacs-lisp
  (use-package all-the-icons-completion
    :after (marginalia all-the-icons)
    :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
    :custom (all-the-icons-completion-mode 1))
#+end_src


*** Orderless

#+begin_src emacs-lisp
  (use-package orderless
    :custom
    (completion-styles '(orderless))
    (completion-category-defaults nil)    ; I want to be in control!
    (orderless-component-separator 'orderless-escapable-split-on-space)
    (orderless-matching-styles
     '(orderless-literal
       orderless-prefixes
       orderless-initialism
       orderless-regexp
       ;; orderless-flex
       ;; orderless-strict-leading-initialism
       ;; orderless-strict-initialism
       ;; orderless-strict-full-initialism
       ;; orderless-without-literal          ; Recommended for dispatches instead
       ))
    (orderless-style-dispatchers
     '(prot-orderless-literal-dispatcher
       prot-orderless-strict-initialism-dispatcher
       prot-orderless-flex-dispatcher))
    :config
    (load-file (expand-file-name "~/.config/emacs/scripts/orderless-utils.el")))
#+end_src


*** Consult

#+begin_src emacs-lisp
  (use-package consult)
#+end_src


*** Embark

#+begin_src emacs-lisp
  (use-package embark
    :bind (("C-." . embark-act)
           :map minibuffer-local-map
                ("C-c C-c" . embark-collect)
                ("C-c C-e" . embark-export)))

  (use-package embark-consult)
#+end_src


*** Corfu

[[https://github.com/minad/corfu][Corfu]] enhances in-buffer completion with a small completion popup. The current candidates are shown in a popup below or above the point. The candidates can be selected by moving up and down. Corfu is the minimalistic in-buffer completion counterpart of the Vertico minibuffer UI.
#+begin_src emacs-lisp
  (use-package corfu
    :init
    (defun corfu-maybe-enable-in-minibuffer ()
      "Enable Corfu in some minibuffers."
      (when (local-variable-p 'completion-at-point-functions)
        (setq-local corfu-auto t)
        (setq-local corfu-echo-delay nil)
        (corfu-mode 1)))
    :config
    (add-hook 'minibuffer-setup-hook #'corfu-maybe-enable-in-minibuffer)
    (global-corfu-mode)
    (corfu-popupinfo-mode))
#+end_src


** Documentation Tools

*** Which Key

#+begin_src emacs-lisp
(use-package which-key
  :config (which-key-mode)
  :diminish which-key-mode
  :custom (which-key-idle-delay 0.5))
#+end_src


