emacs/init.el
;; -*- lexical-binding: t; -*-
;; Note: This file is automatically generated from default.org.  
;; Please do not edit this file directly but init.org instead.

(setopt current-language-environment "UTF-8")

(dolist (symbol '(dired-find-alternate-file
                  downcase-region
                  eval-expression
                  narrow-to-page
                  narrow-to-region
                  scroll-left
                  upcase-region))
  (put symbol 'disable nil))

(add-to-list 'load-path (expand-file-name "scripts/" "~/.config/emacs/"))

;;;;* Load Customizations
(unless (and (boundp 'custom-file)
	     custom-file
	     (file-writable-p custom-file))
  (let ((default-custom-file (expand-file-name "custom.el"
					       (file-name-directory load-file-name))))
    (setq custom-file default-custom-file)))

(setopt column-number-mode t
        global-display-line-numbers-mode t)

(let ((hooks '(org-mode-hook dired-mode-hook treemacs-mode-hook term-mode-hook shell-mode-hook ehell-mode-hook)))
(dolist (hook hooks)
  (add-hook hook (lambda () (display-line-numbers-mode 0))))

(setopt display-line-numbers-grow-only t
        display-line-numbers-width-start 50
        display-line-numbers-minor-tick 0
        display-line-numbers-major-tick 10)
(set-face-attribute 'line-number nil
                    :inherit '(shadow default)
                    :foreground "dark slate gray"
                    :height 0.7)
(set-face-attribute 'line-number-current-line nil
                    :inherit 'line-number
                    :foreground "olive drab")
(set-face-attribute 'line-number-major-tick nil
                    :inherit 'line-number
                    :background (face-attribute 'line-number :background)
                    :foreground "#3f4f0f")
(set-face-attribute 'line-number-minor-tick nil
                    :inherit 'line-number)
)

(defvar oa-proxy-connect:*process* nil
  "Contains the process of ch.swisslife.ProxyConnect.")
(defun oa-proxy-connect:start ()
  "Start ch.swisslife.ProxyConnect and return the process object."
  (interactive)
  (unless (process-live-p oa-proxy-connect:*process*)
    (setq oa-proxy-connect:*process* (start-process "proxy-connect" nil "proxy-connect"))))
(defun oa-proxy-connect:stop ()
  "Stop ch.swisslife.ProxyConnect and return `true' if a running process has been stopped, `nil' else."
  (interactive)
  (when-let ((livep (process-live-p oa-proxy-connect:*process*)))
    (delete-process oa-proxy-connect:*process*)
    (setq oa-proxy-connect:*process* nil)
    livep))

(setopt url-proxy-services
        '(("no_proxy" . "^\\\\(fi-r-git\\\\|localhost\\\\|10\\\\..*\\\\|192\\\\.168\\\\..*\\\\)")
          ("http" . "localhost:8080")
          ("https" . "localhost:8080")))

(oa-proxy-connect:start)

(require 'package)

(setopt package-archives
        '(("gnu" . "http://elpa.gnu.org/packages/")
          ("melpa" . "http://melpa.org/packages/")
          ("org" . "http://orgmode.org/elpa/"))
        package-check-signature nil
        package-selected-packages nil)

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setopt use-package-always-ensure t)

(use-package emacs
  :ensure nil
  :custom
  (savehist-mode t)
  (recentf-mode t)
  (recentf-save-file "~/.config/emacs/recentf")
  (recentf-exclude '(".*/[.]recentf\\'"))
  (search-whitespace-regexp ".*?")
  (isearch-allow-scroll t)
  (isearch-lazy-count t)
  (show-paren-style 'expression)
  (enable-recursive-minibuffers t)
  (minibuffer-depth-indicate-mode t)
  (mouse-autoselect-window -0.25)
  (focus-follows-mouse 'auto-raise)
  (indent-tabs-mode nil))

(use-package general)

(use-package all-the-icons)

(use-package vertico
  :custom
  (vertico-cycle t)
  (vertico-mode 1))

(use-package marginalia
  :custom (marginalia-mode 1))

(use-package all-the-icons-completion
  :after (marginalia all-the-icons)
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :custom (all-the-icons-completion-mode 1))

(use-package orderless
  :custom
  (completion-styles '(orderless))
  (completion-category-defaults nil)    ; I want to be in control!
  (orderless-component-separator 'orderless-escapable-split-on-space)
  (orderless-matching-styles
   '(orderless-literal
     orderless-prefixes
     orderless-initialism
     orderless-regexp
     ;; orderless-flex
     ;; orderless-strict-leading-initialism
     ;; orderless-strict-initialism
     ;; orderless-strict-full-initialism
     ;; orderless-without-literal          ; Recommended for dispatches instead
     ))
  (orderless-style-dispatchers
   '(prot-orderless-literal-dispatcher
     prot-orderless-strict-initialism-dispatcher
     prot-orderless-flex-dispatcher))
  :config
  (load-file (expand-file-name "~/.config/emacs/scripts/orderless-utils.el")))

(use-package consult)

(use-package embark
  :bind (("C-." . embark-act)
         :map minibuffer-local-map
              ("C-c C-c" . embark-collect)
              ("C-c C-e" . embark-export)))

(use-package embark-consult)

(use-package corfu
  :init
  (defun corfu-maybe-enable-in-minibuffer ()
    "Enable Corfu in some minibuffers."
    (when (local-variable-p 'completion-at-point-functions)
      (setq-local corfu-auto t)
      (setq-local corfu-echo-delay nil)
      (corfu-mode 1)))
  :config
  (add-hook 'minibuffer-setup-hook #'corfu-maybe-enable-in-minibuffer)
  (global-corfu-mode)
  (corfu-popupinfo-mode))

(use-package which-key
  :config (which-key-mode)
  :diminish which-key-mode
  :custom (which-key-idle-delay 0.5))
