emacs/init.org
*** Helpful

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp
  (use-package helpful
    :ensure t
    :bind
    ([remap describe-function] . helpful-callable)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key))
#+end_src


** Navigation

***  ACE Window

#+begin_src emacs-lisp
  (use-package ace-window
    :bind
    (("C-$" . ace-window))
    :custom
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src


*** Wgrep

#+begin_src emacs-lisp
  (use-package wgrep
    :bind
    (:map grep-mode-map
	  ("e" . wgrep-change-to-wgrep-mode)
	  ("C-x C-q" . wgrep-change-to-wgrep-mode)
	  ("C-c C-c" . wgrep-finish-edit)))
#+end_src


*** Ripgrep-Mode

See the [[https://rgel.readthedocs.io/en/latest/index.html][rg manual]].

#+begin_src emacs-lisp
  (use-package rg)
#+end_src


** Appearance

*** DOOM Modeline

#+begin_src emacs-lisp :tangle no
  (use-package doom-modeline
    :config (doom-modeline-mode 1)
    :custom (doom-modeline-height 12))
#+end_src


*** DOOM Themes

#+begin_src emacs-lisp :tangle no
  (use-package doom-themes)
#+end_src



** Editing

*** Multiple-Cursors

#+begin_src emacs-lisp
  (use-package multiple-cursors)
#+end_src


*** IEdit

#+begin_src emacs-lisp
  (use-package iedit
    :config
    (defun iedit-dwim (arg)
      "Starts iedit but uses \\[narrow-to-defun] to limit its scope."
      (interactive "P")
      (if arg
	  (iedit-mode)
	(save-excursion
	  (save-restriction
	    (widen)
	    ;; this function determines the scope of `iedit-start'.
	    (if iedit-mode
		(iedit-done)
	      ;; `current-word' can of course be replaced by other
	      ;; functions.
	      (narrow-to-defun)
	      (iedit-start (current-word) (point-min) (point-max)))))))
    :bind
    (( "C-;" . iedit-dwim)))
#+end_src


* Version Control

** Magit

[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp
  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

*** TODO Forge

NOTE: Make sure to configure a GitHub token before using this package!
- https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
- https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started

#+begin_src emacs-lisp :tangle no
  (use-package forge)
#+end_src


*** Magit Filenotify

Minor mode using emacs' =file-notify= for refreshing =magit='s status buffer at changes in the working directory.  To activate the feature, call =magit-filenotify= in the status buffer.

#+begin_src emacs-lisp
  (use-package magit-filenotify)
#+end_src

*** Git Timemachine

Visit a git-controlled file and issue `M-x git-timemachine` (or bind it to a keybinding of your choice).  If you just need to toggle the time machine you can use `M-x git-timemachine-toggle`.

Use the following keys to navigate historic version of the file
- =p= Visit previous historic version
- =n= Visit next historic version
- =w= Copy the abbreviated hash of the current historic version
- =W= Copy the full hash of the current historic version
- =g= Goto nth revision
- =t= Goto revision by selected commit message
- =q= Exit the time machine
- =b= Run =magit-blame= on the currently visited revision (if magit available)
- =c= Show current commit using magit (if magit available)

#+begin_src emacs-lisp
  (use-package git-timemachine)
#+end_src

*** Git Modes Package

This packages provides the major modes =git-attributes-mode=, =git-config-mode= and =git-ignore-mode= for editing corresponding files.
#+begin_src emacs-lisp
  (use-package git-modes)
#+end_src

*** Git Gutter

#+begin_src emacs-lisp
  (use-package git-gutter
    :hook (prog-mode . git-gutter-mode)
    :config
    (setq git-gutter:update-interval 0.02))

  (use-package git-gutter-fringe
    :config
    (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))
#+end_src


** Swagg

We use the package [[https://github.com/isamert/swagg.el][swagg]] for fetching the Swagger API of Gitea.

#+begin_src emacs-lisp :tangle no
  (use-package swagg
    :custom
    swagg-definitions
    '((:name "FI-R-GIT"
             :json "http://fi-r-git/api/swagger"
             :base "http://fi-r-git/swagger.v1.json"
             :header (Authorization "c41ffd470c3211c0bd773d79d1e152273f62f1a1"))
      (:name "GitHub"
             :json "https://raw.githubusercontent.com/github/rest-api-description/main/descriptions/api.github.com/api.github.com.json"
             :base "https://api.github.com")
      (:name "GitLab"
             :yaml "https://gitlab.com/gitlab-org/gitlab/-/raw/master/doc/api/openapi/openapi.yaml"
             :base "https://gitlab.com/api")))
#+end_src

* Org Mode

[[https://orgmode.org/][Org Mode]] is one of the hallmark features of Emacs.  It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.

** Basic Config

This section contains the basic configuration for =org-mode= plus the configuration for Org agendas and capture templates.  There's a lot to unpack in here so I'd recommend watching the videos for [[https://youtu.be/VcgjTEa0kU4][Part 5]] and [[https://youtu.be/PNE-mgkZ6HM][Part 6]] for a full explanation.

We use variable pitch for the text.  

#+begin_src emacs-lisp
  (use-package org
    :pin org

    :hook
    ((org-mode . variable-pitch-mode)
     (org-mode . visual-line-mode)
     (org-mode . org-indent-mode))

    :bind
    ("C-c j" . (lambda () (interactive) (org-capture nil "jj")))

    :config

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    ;;(advice-add 'org-refile :after 'org-save-all-org-buffers)
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    :custom
    (org-ellipsis " ▾")
    (org-hide-emphasis-markers t)

    :custom-face
    (org-block ((t (:inherit fixed-pitch))))
    (org-table ((t (:inherit fixed-pitch))))
    (org-formula ((t (:inherit fixed-pitch))))
    (org-code ((t (:inherit fixed-pitch))))
    (org-table ((t (:inherit fixed-pitch))))
    (org-verbatim ((t (:inherit fixed-pitch))))
    (org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
    (org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
    (org-checkbox ((t (:inherit fixed-pitch)))))
#+end_src

*** Nicer Heading Bullets

[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in =org-mode= buffers with nicer looking characters that you can control.  Another option for this is [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] which we may cover in a later video.

#+begin_src emacs-lisp
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

*** Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.

#+begin_src emacs-lisp
  (use-package visual-fill-column
    :after org
    :hook (org-mode . visual-fill-column-mode)
    :custom
    (visual-fill-column-width 100)
    (visual-fill-column-center-text t))
#+end_src

*** Drag-and-Drop images with =org-download=

Utility taken from [[https://github.com/abo-abo/org-download#org-download][here]].

#+begin_src emacs-lisp
  (use-package org-download
    :after (org dired)
    :hook (dired-mode . org-download-enable))
#+end_src


** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))

(push '("conf-unix" . conf-unix) org-src-lang-modes)

#+end_src


** Structure Templates

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type =<el= and press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][as it is known by Org Babel]].

#+begin_src emacs-lisp
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (dolist (template '(("sh" . "src shell")
                      ("el" . "src emacs-lisp")
                      ("py" . "src python")))
    (add-to-list 'org-structure-template-alist template))
#+end_src



* Development

** TODO Language Server Protocol

*** IDE Features with lsp-mode

**** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook
    ((lsp-mode . lsp-headerline-breadcrumb-mode)
     (lsp-mode . (lambda ()
		   (keymap-local-set lsp-keymap-prefix lsp-command-map)))
     (lsp-mode . lsp-enable-which-key-integration))
    :custom
    (lsp-keymap-prefix "C-c l"))
#+end_src

