emacs/init.org
**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))
#+end_src

**** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :after lsp)
#+end_src

*** TODO Debugging with dap-mode

[[https://emacs-lsp.github.io/dap-mode/][dap-mode]] is an excellent package for bringing rich debugging capabilities to Emacs via the [[https://microsoft.github.io/debug-adapter-protocol/][Debug Adapter Protocol]].  You should check out the [[https://emacs-lsp.github.io/dap-mode/page/configuration/][configuration docs]] to learn how to configure the debugger for your language.  Also make sure to check out the documentation for the debug adapter to see what configuration parameters are available to use for your debug templates!

#+begin_src emacs-lisp :tangle no

  (use-package dap-mode
    ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    ;; :config
    ;; (dap-ui-mode 1)

    :config
    ;; Set up Node debugging
    (require 'dap-node)
    (dap-node-setup) ;; Automatically installs Node debug adapter if needed

    ;; Bind `C-c l d` to `dap-hydra` for easy access
    (general-define-key
      :keymaps 'lsp-mode-map
      :prefix lsp-keymap-prefix
      "d" '(dap-hydra t :wk "debugger")))

#+end_src


** Lisp Modes

#+begin_src emacs-lisp

  (defun oa:init-isearch-mode-map ()
    (make-local-variable 'isearch-mode-map)
    (define-key isearch-mode-map "\C-w" 'isearch-yank-symbol-or-char))

  (add-hook 'emacs-lisp-mode-hook 'oa:init-isearch-mode-map)
  (add-hook 'lisp-mode-hook 'oa:init-isearch-mode-map)

#+end_src

*** Macrostep

#+begin_src emacs-lisp
  (use-package macrostep)
#+end_src


*** Parenface 

Use a special face for parentheses.

#+begin_src emacs-lisp
  (use-package paren-face
    :config (global-paren-face-mode)
    :custom-face
    (parenthesis ((t (:foreground "DodgerBlue4")))))
#+end_src

*** Highlight Parentheses

#+begin_src emacs-lisp
  (use-package highlight-parentheses
    :config
    (global-highlight-parentheses-mode)
    :hook
    ((emacs-lisp-mode lisp-mode) . highlight-parentheses-mode)
    :custom
    (highlight-parentheses-colors
     '("gold1" "orange1" "IndianRed2" "Purple2" "SteelBlue" "dark slate gray")))
#+end_src

*** Highlight Stages
The =highlight-stages-jit-highlighter= has a bug which manifests itself, among others, in the =org-mode=.  Therefore we don't use the =highlight-stages-global-mode=.  In lisp mode it seems to work well, however...

#+begin_src emacs-lisp
  (use-package highlight-stages
    :hook ((emacs-lisp-mode lisp-mode) . highlight-stages-mode)
    :custom
    (highlight-stages-highlight-real-quote nil)
    :custom-face
    (highlight-stages-negative-level-face ((((background light)) :background "#ffdfdf")
                                           (t :background "442424")))
    (highlight-stages-level-1-face ((((background light)) :background "#ffffbf")
                                    (t :background "#444404")))
    (highlight-stages-level-2-face ((((background light)) :background "#efffcf")
                                    (t :background "#344414")))
    (highlight-stages-level-3-face ((((background light)) :background "#dfffdf")
                                    (t :background "#244424")))
    (highlight-stages-higher-level-face ((((background light)) :background "#cfffef")
                                         (t :background "#144434"))))
#+end_src

*** Paredit

#+begin_src emacs-lisp
(use-package paredit
  :bind (:map paredit-mode-map
              ([return] . paredit-newline)
              ([C-return] . comment-indent-new-line))
  :hook
  ((emacs-lisp-mode lisp-mode) . paredit-mode))
#+end_src


*** Add Hooks

**** For Emacs Lisp Mode

#+begin_src emacs-lisp
(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
(add-hook 'lisp-interaction-mode-hook
          (lambda () (local-set-key [C-S-return] 'eval-print-last-sexp)))
#+end_src


**** For Common Lisp Mode

#+begin_src emacs-lisp
  (add-hook 'lisp-mode-hook
            (lambda () (setq lisp-indent-function 'common-lisp-indent-function)))
#+end_src



* Shells in Emacs

** shell-mode

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Interactive-Shell.html#Interactive-Shell][shell-mode]] is a middle ground between =term-mode= and Eshell.  It is *not* a terminal emulator so more complex terminal programs will not run inside of it.  It does have much better integration with Emacs because all command input in this mode is handled by Emacs and then sent to the underlying shell once you press Enter.  This means that you can use =evil-mode='s editing motions on the command line, unlike in the terminal emulator modes above.

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =M-p= / =M-n= - go back and forward in the input history
- =C-c C-u= - delete the current input string backwards up to the cursor
- =counsel-shell-history= - A searchable history of commands typed into the shell

One advantage of =shell-mode= on Windows is that it's the only way to run =cmd.exe=, PowerShell, Git Bash, etc from within Emacs.  Here's an example of how you would set up =shell-mode= to run PowerShell on Windows:

On our system =cmd.exe= or Powershell use by default the code page 850. So we set this code page as process coding system:

#+begin_src emacs-lisp
  (add-hook (derived-mode-hook-name 'shell-mode)
            (lambda () (set-buffer-process-coding-system 'cp850-dos 'cp850-dos)))
#+end_src


** Eshell

[[https://www.gnu.org/software/emacs/manual/html_mono/eshell.html#Contributors-to-Eshell][Eshell]] is Emacs' own shell implementation written in Emacs Lisp.  It provides you with a cross-platform implementation (even on Windows!) of the common GNU utilities you would find on Linux and macOS (=ls=, =rm=, =mv=, =grep=, etc).  It also allows you to call Emacs Lisp functions directly from the shell and you can even set up aliases (like aliasing =vim= to =find-file=).  Eshell is also an Emacs Lisp REPL which allows you to evaluate full expressions at the shell.

The downsides to Eshell are that it can be harder to configure than other packages due to the particularity of where you need to set some options for them to go into effect, the lack of shell completions (by default) for some useful things like Git commands, and that REPL programs sometimes don't work as well.  However, many of these limitations can be dealt with by good configuration and installing external packages, so don't let that discourage you from trying it!

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =M-p= / =M-n= - go back and forward in the input history
- =C-c C-u= - delete the current input string backwards up to the cursor

For more thoughts on Eshell, check out these articles by Pierre Neidhardt:
- https://ambrevar.xyz/emacs-eshell/index.html
- https://ambrevar.xyz/emacs-eshell-versus-shell/index.html

#+begin_src emacs-lisp
  (use-package eshell-git-prompt)

  (use-package eshell
    :config
    (eshell-git-prompt-use-theme 'powerline)
    :custom
    (eshell-modules-list
     '(eshell-alias eshell-banner eshell-basic eshell-cmpl eshell-dirs eshell-glob eshell-hist eshell-ls eshell-pred eshell-prompt eshell-rebind eshell-script eshell-smart eshell-term eshell-unix)))
#+end_src


* File Management

** Dired

Dired is a built-in file manager for Emacs that does some pretty amazing things!  Here are some key bindings you should try out:

*** Key Bindings

**** Navigation

*Emacs* / *Evil*
- =n= / =j= - next line
- =p= / =k= - previous line
- =j= / =J= - jump to file in buffer
- =RET= - select file or directory
- =^= - go to parent directory
- =S-RET= / =g O= - Open file in "other" window
- =M-RET= - Show file in other window without focusing (previewing files)
- =g o= (=dired-view-file=) - Open file but in a "preview" mode, close with =q=
- =g= / =g r= Refresh the buffer with =revert-buffer= after changing configuration (and after filesystem changes!)

**** Marking files

- =m= - Marks a file
- =u= - Unmarks a file
- =U= - Unmarks all files in buffer
- =* t= / =t= - Inverts marked files in buffer
- =% m= - Mark files in buffer using regular expression
- =*= - Lots of other auto-marking functions
- =k= / =K= - "Kill" marked items (refresh buffer with =g= / =g r= to get them back)
- Many operations can be done on a single file if there are no active marks!
 
**** Copying and Renaming files

- =C= - Copy marked files (or if no files are marked, the current file)
- Copying single and multiple files
- =U= - Unmark all files in buffer
- =R= - Rename marked files, renaming multiple is a move!
- =% R= - Rename based on regular expression: =^test= , =old-\&=

*Power command*: =C-x C-q= (=dired-toggle-read-only=) - Makes all file names in the buffer editable directly to rename them!  Press =Z Z= to confirm renaming or =Z Q= to abort.

**** Deleting files

- =D= - Delete marked file
- =d= - Mark file for deletion
- =x= - Execute deletion for marks
- =delete-by-moving-to-trash= - Move to trash instead of deleting permanently

**** Creating and extracting archives

- =Z= - Compress or uncompress a file or folder to (=.tar.gz=)
- =c= - Compress selection to a specific file
- =dired-compress-files-alist= - Bind compression commands to file extension

**** Other common operations

- =T= - Touch (change timestamp)
- =M= - Change file mode
- =O= - Change file owner
- =G= - Change file group
- =S= - Create a symbolic link to this file
- =L= - Load an Emacs Lisp file into Emacs

*** TODO Configuration

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom
    (dired-auto-revert-buffer #'dired-directory-changed-p)
    (dired-make-directory-clickable t)
    (dired-recursive-copies 'always)
    (dired-recursive-deletes 'always)
    (delete-by-moving-to-trash t)
    (dired-dwim-target t)
    (dired-listing-switches "-AGFhlv --group-directories-first --time-style=iso --dired --color"))

  (use-package dired-single)

  (use-package dired-git-info)

  (use-package dired-k)

  (use-package dired-quick-sort)

  (use-package dired-rainbow)

  (use-package dired-subtree)

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open)

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode))

#+end_src





* Load Custom File

Load custom file.

#+begin_src emacs-lisp
  (load custom-file t t t t)
#+end_src



* Appearance

