emacs/init.el

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(defun oa:init-isearch-mode-map ()
  (make-local-variable 'isearch-mode-map)
  (define-key isearch-mode-map "\C-w" 'isearch-yank-symbol-or-char))

(add-hook 'emacs-lisp-mode-hook 'oa:init-isearch-mode-map)
(add-hook 'lisp-mode-hook 'oa:init-isearch-mode-map)

(use-package macrostep)

(use-package paren-face
  :config (global-paren-face-mode)
  :custom-face
  (parenthesis ((t (:foreground "DodgerBlue4")))))

(use-package highlight-parentheses
  :config
  (global-highlight-parentheses-mode)
  :hook
  ((emacs-lisp-mode lisp-mode) . highlight-parentheses-mode)
  :custom
  (highlight-parentheses-colors
   '("gold1" "orange1" "IndianRed2" "Purple2" "SteelBlue" "dark slate gray")))

(use-package highlight-stages
  :hook ((emacs-lisp-mode lisp-mode) . highlight-stages-mode)
  :custom
  (highlight-stages-highlight-real-quote nil)
  :custom-face
  (highlight-stages-negative-level-face ((((background light)) :background "#ffdfdf")
                                         (t :background "442424")))
  (highlight-stages-level-1-face ((((background light)) :background "#ffffbf")
                                  (t :background "#444404")))
  (highlight-stages-level-2-face ((((background light)) :background "#efffcf")
                                  (t :background "#344414")))
  (highlight-stages-level-3-face ((((background light)) :background "#dfffdf")
                                  (t :background "#244424")))
  (highlight-stages-higher-level-face ((((background light)) :background "#cfffef")
                                       (t :background "#144434"))))

(use-package paredit
  :bind (:map paredit-mode-map
              ([return] . paredit-newline)
              ([C-return] . comment-indent-new-line))
  :hook
  ((emacs-lisp-mode lisp-mode) . paredit-mode))

(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
(add-hook 'lisp-interaction-mode-hook
          (lambda () (local-set-key [C-S-return] 'eval-print-last-sexp)))

(add-hook 'lisp-mode-hook
          (lambda () (setq lisp-indent-function 'common-lisp-indent-function)))

(add-hook (derived-mode-hook-name 'shell-mode)
          (lambda () (set-buffer-process-coding-system 'cp850-dos 'cp850-dos)))

(use-package eshell-git-prompt)

(use-package eshell
  :config
  (eshell-git-prompt-use-theme 'powerline)
  :custom
  (eshell-modules-list
   '(eshell-alias eshell-banner eshell-basic eshell-cmpl eshell-dirs eshell-glob eshell-hist eshell-ls eshell-pred eshell-prompt eshell-rebind eshell-script eshell-smart eshell-term eshell-unix)))

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom
  (dired-auto-revert-buffer #'dired-directory-changed-p)
  (dired-make-directory-clickable t)
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'always)
  (delete-by-moving-to-trash t)
  (dired-dwim-target t)
  (dired-listing-switches "-AGFhlv --group-directories-first --time-style=iso --dired --color"))

(use-package dired-single)

(use-package dired-git-info)

(use-package dired-k)

(use-package dired-quick-sort)

(use-package dired-rainbow)

(use-package dired-subtree)

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-open)

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode))

(load custom-file t t t t)

(use-package emacs
  :custom-face
