emacs/init.org
** Faces

We set some faces.

#+begin_src emacs-lisp
  (use-package emacs
    :custom-face
    (fixed-pitch ((t (:foundry "outline" :family "Fira Code Retina"))))
    (default ((t (:height 130 :weight normal :width normal :slant normal :foundry "outline" :family "Fira Code Retina"))))
    (fixed-pitch-serif ((t (:family "Courier New"))))
    (variable-pitch ((t (:inherit default :height 1.35 :foundry "outline" :family "Fira Sans")))))
#+end_src


** COMMENT Modus Themes

#+begin_src emacs-lisp :tangle no
  (use-package modus-themes
    :ensure nil
    :init (modus-themes-load-themes)
    :config (modus-themes-load-vivendi))
#+end_src






#+Local Variables: 
#+eval: (add-hook 'after-save-hook (lambda () (when (y-or-n-p "Tangle?") (let ((org-confirm-babel-evaluate nil)) (org-babel-tangle)) (when (y-or-n-p "Reload?") (load-file user-init-file)))) nil t) 
#+End:
