emacs/init.el
  (fixed-pitch ((t (:foundry "outline" :family "Fira Code Retina"))))
  (default ((t (:height 130 :weight normal :width normal :slant normal :foundry "outline" :family "Fira Code Retina"))))
  (fixed-pitch-serif ((t (:family "Courier New"))))
  (variable-pitch ((t (:inherit default :height 1.4 :foundry "outline" :family "Fira Sans")))))
